# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [5]:
#Your code here
import pandas as pd
import sqlite3
connection = sqlite3.connect('data.sqlite')
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [3]:
#Your code here
cursor.execute('''SELECT lastName, firstName FROM employees JOIN offices USING(officecode) WHERE city = 'Boston';''').fetchall()

[('Firrelli', 'Julie'), ('Patterson', 'Steve')]

## Do any offices have no employees?

In [15]:
#Your code here
cursor.execute("""SELECT city, COUNT(*) FROM offices
                        LEFT JOIN employees
                        USING(officeCode)
                        GROUP BY 1;
                       """)
df = pd.DataFrame(cursor.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cursor.description]
df.head()

# answer is NO

            city  COUNT(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [18]:
# Your code here
# What product had the highest quantity ordered?

cursor.execute("""SELECT * FROM products LEFT JOIN orderdetails USING(productCode) ORDER BY quantityOrdered DESC;""")
df = pd.DataFrame(cursor.fetchall()) 
df.columns = [i[0] for i in cursor.description]
df.head()

# 1969 Dodge Charger

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP,orderNumber,quantityOrdered,priceEach,orderLineNumber
0,S12_4675,1969 Dodge Charger,Classic Cars,1:12,Welly Diecast Productions,Detailed model of the 1969 Dodge Charger. This...,7323,58.73,115.16,10405,97,115.16,5
1,S18_3278,1969 Dodge Super Bee,Classic Cars,1:18,Min Lin Diecast,"This replica features opening doors, superb de...",1917,49.05,80.41,10404,90,67.54,6
2,S700_2466,America West Airlines B757-200,Planes,1:700,Motor City Art Classics,Official logos and insignias. Working steering...,9653,68.80,99.72,10401,85,98.72,10
3,S12_3990,1970 Plymouth Hemi Cuda,Classic Cars,1:12,Studio M Art Models,Very detailed 1970 Plymouth Cuda model in 1:12...,5663,31.92,79.80,10404,77,67.03,4
4,S700_3167,F/A 18 Hornet 1/72,Planes,1:72,Motor City Art Classics,"10"" Wingspan with retractable landing gears.Co...",551,54.40,80.00,10401,77,73.60,9

In [22]:
# Your code here
# Who had the first order?

cursor.execute("""SELECT * FROM customers JOIN orders USING(customerNumber) ORDER BY orderDate ASC;""")
df = pd.DataFrame(cursor.fetchall()) 
df.columns = [i[0] for i in cursor.description]
df.head()

# Dorothy You

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit,orderNumber,orderDate,requiredDate,shippedDate,status,comments
0,363,Online Diecast Creations Co.,Young,Dorothy,6035558647,2304 Long Airport Avenue,,Nashua,NH,62005,USA,1216,114200.00,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,
1,128,"Blauer See Auto, Co.",Keitel,Roland,+49 69 66 90 2555,Lyonerstr. 34,,Frankfurt,,60528,Germany,1504,59700.00,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.
2,181,Vitachrome Inc.,Frick,Michael,2125551500,2678 Kingston Rd.,Suite 101,NYC,NY,10022,USA,1286,76400.00,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,
3,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,,Stavern,,4110,Norway,1504,81700.00,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,
4,141,Euro+ Shopping Channel,Freyre,Diego,(91) 555 94 44,"C/ Moralzarzal, 86",,Madrid,,28034,Spain,1370,227600.00,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!